using System;

namespace rw1{

    class rw1{

        static void Main(){

            int i = 100;

            for (int d = 1; d <= 100; d++){
                if(i % d == 0)
                Console.WriteLine(d);
                
            }

        }

    }

}
/*
Дано натуральное число.
а) Получить все его делители.
б) Найти сумму его делителей.
в) Найти сумму его четных делителей.
г) Определить количество его делителей.
д) Определить количество его нечетных делителей.
е) Определить количество его делителей. Сколько из них четных?
ж) Найти количество его делителей, больших d.
*/